app/Controllers/Auth/Auth.php

    public function login()
    {
        $model = new UserModel();

        $npm = $this->request->getVar('npm');
        $password = $this->request->getVar('password');

        $user = $model->where('npm', $npm)->first();
---
SELECT *
FROM `user`
WHERE `npm` = '4'
 LIMIT 1