app/Controllers/Auth/Auth.php

    public function login()
    {
        $npm = $this->request->getVar('npm');
        $password = $this->request->getVar('password');
        $user = $this->userModel->where('npm', $npm)->first();
---
SELECT *
FROM `user`
WHERE `npm` = '2'
 LIMIT 1

    public function password_reset()
    {

        helper(['string']);
        $rules = [
            'email' => 'required|min_length[4]|max_length[100]|valid_email'
        ];

        if ($this->validate($rules)) {

            $token = mt_rand(100000, 999999);

            $userdata = $this->userModel->where('email', $this->request->getVar('email'))->first();

            if (!$userdata) {
                // Jika email tidak ditemukan di database
                echo '<script>alert("Email not found in the database.");</script>';
                echo '<script>window.location.href = "' . base_url('/forgotpassword') . '";</script>';
                exit;
            }


            $data = [
                'email' => $this->request->getVar('email'),
                'token' => $token,
            ];
            $this->userModel->update($userdata['npm'], $data);
---
SELECT *
FROM `user`
WHERE `email` = 'Marcsatrioff@gmail.com'
 LIMIT 1
UPDATE `user` SET `email` = 'Marcsatrioff@gmail.com', `token` = 881691, `updated_at` = '2023-06-07 01:21:39'
WHERE `user`.`npm` IN ('2021320010')