app/Controllers/Admin/Admin.php

SELECT *
FROM `user`
WHERE `npm` = '1'
 LIMIT 1
---
    public function index()
    {
        //tolong masukin di setiap method//
        $userModel = new UserModel();
        $data = [
            'title' => 'Parking Management System',
            'user' => $userModel->where('npm', session('npm'))->first()