app/Controllers/Admin/Berkas.php

DELETE FROM `berkas`
WHERE `id_berkas` IN ('6')
---
	public function delete($id)
    {
        $berkasModel = new PengumumanModel();
        $berkas = $berkasModel->find($id);

		if ($berkas) {
			// Hapus file terlebih dahulu
			$path = WRITEPATH . 'uploads/berkas/' . $berkas->berkas;
			if (file_exists($path)) {
				unlink($path);
			}

			// Hapus data dari database
			$berkasModel->delete($id);