app/Controllers/Admin/Dashboard.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '1'
 LIMIT 1
---
    public function index()
    {
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first()
            ];