app/Controllers/Admin/Transaksi.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
---
    public function transaksi_inputkodebooking()
    {
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first()

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `kodebooking_transaksi` = 'SLQEX6'
 LIMIT 1
---
    public function transaksi_approve()
    {
        $validationRules = [
            'nomor_kartu' => [
                'rules' => 'is_unique[kartu.nomor_kartu]',
                'errors' => [
                    'is_unique' => 'Nomor Kartu ini Telah Digunakan Sebelumnya',
                    'required' => 'Harus Di Isi'
                ]
            ]
        ];

        if (!$this->validate($validationRules)) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->to("admin/transaksi_inputkodebooking");
        }
        $kodebooking_transaksi = $this->request->getVar('kode_booking');
        $nomor_kartu = $this->request->getVar('nomor_kartu');

        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->where('npm', session('npm'))
                    ->first(),
                'transaksi' => $this->transaksiModel
                    ->join('user', 'user.npm = transaksi.npm')
                    ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                    ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                    ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                    ->where('kodebooking_transaksi', $kodebooking_transaksi)
                    ->first(),

UPDATE `transaksi` SET `id_transaksi` = '19', `saldoawal_transaksi` = '220000', `saldoakhir_transaksi` = 420000, `id_status_transaksi` = 3, `updated_at` = '2023-05-29 19:05:18'
WHERE `transaksi`.`id_transaksi` IN ('19')
UPDATE `kartu` SET `id_kartu` = '6', `saldo` = 420000, `updated_at` = '2023-05-29 19:05:18'
WHERE `kartu`.`id_kartu` IN ('6')
---
            ->where('kodebooking_transaksi', $kodebooking_transaksi)
            ->first();

        $this->transaksiModel->save(
            [
                'id_transaksi' => $transaksi['id_transaksi'],
                'saldoawal_transaksi' => $transaksi['saldo'],
                'saldoakhir_transaksi' => $transaksi['saldo'] + $transaksi['nominal_transaksi'],
                'id_status_transaksi' => 3,
            ]
        );
        if (!$nomor_kartu) {
            $this->kartuModel->save(
                [
                    'id_kartu' => $transaksi['id_kartu'],
                    'saldo' => $transaksi['saldo'] + $transaksi['nominal_transaksi'],
                ]
            );