app/Controllers/Admin/Transaksi.php

    public function bukti($id_transaksi)
    {
        $data = $this->request->getFile('bukti_pembayaran');
        $fileName = date('YmdHis') . '_' . $data->getRandomName();
        $uploadDir = 'uploads/bukti/';

        $data->move($uploadDir, $fileName);

        $user = $this->transaksiModel
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->where('id_transaksi', $id_transaksi)
            ->first();
---
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
WHERE `id_transaksi` = '130'
 LIMIT 1