app/Controllers/Admin/User.php

    public function userRead()
    {
        $limit = 9; // Jumlah item per halaman
        $currentPage = $this->request->getVar('page_pagination') ? $this->request->getVar('page_pagination') : 1;
        $totalRows = $this->userModel->countAllResults();

        $data = [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(),
            'users' => $this->userModel->join('kartu', 'kartu.id_kartu = user.id_kartu')->paginate($limit, 'pagination'),
            'pager' => $this->userModel->pager,
            'currentPage' => $currentPage,
            'limit' => $limit,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '1'
 LIMIT 1
SELECT *
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`

    public function userUpdate($npm)
    { {
            $data =
                [
                    'title' => 'Parking Management System',
                    'user' => $this->userModel
                        ->join('role', 'role.id_role = user.id_role')
                        ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                        ->where('npm', $npm)
                        ->first(),
                ];
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '3'
 LIMIT 1
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '4'
 LIMIT 1

    public function userEdit($npm)
    {
        $data = $this->request->getPost();
        $user = $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->join('status', 'status.id_status = user.id_status')
            ->join('kartu', 'kartu.id_kartu = user.id_kartu')
            ->where('npm', $npm)
            ->first();

        if ($user) {
            $this->userModel->update($user['npm'], $data); // Menggunakan id dari user untuk update data
            session()->setFlashdata('berhasil', '<br>');

            // Misalkan Anda ingin juga melakukan update pada model kartu
            $this->kartuModel->update($user['id_kartu'], $data); // Menggunakan id_kartu dari user untuk update data pada model kartu
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `status` ON `status`.`id_status` = `user`.`id_status`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '3'
 LIMIT 1
UPDATE `kartu` SET `nomor_kartu` = '5524232', `saldo` = '14000', `updated_at` = '2023-06-16 01:37:25'
WHERE `kartu`.`id_kartu` IN ('5')
UPDATE `user` SET `nama` = 'dapidah', `email` = 'davidst@gmail.com', `id_role` = '3', `id_status` = '1', `masa_berlaku` = '', `updated_at` = '2023-06-16 01:37:25'
WHERE `user`.`npm` IN ('3')