app/Controllers/Keuangan/Berkas.php

	public function readBerkas()
	{
        $data =
        [
            'title' => 'Parking Management System',
            'user' => $this->userModel
                ->join('role', 'role.id_role = user.id_role')
                ->where('npm', session('npm'))
                ->first(),
            'role' => $this->roleModel->findAll()
        ];
		$berkas = new PengumumanModel();
		$data['berkas'] = $berkas->findAll();
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
SELECT *
FROM `role`
SELECT *
FROM `berkas`

	public function save()
	{
		if (!$this->validate([
			'keterangan' => [
				'rules' => 'required',
				'errors' => [
					'required' => '{field} Tidak boleh kosong'
				]
			],
			'berkas' => [
				'rules' => 'uploaded[berkas]|ext_in[berkas,pdf]|max_size[berkas,2048]',
				'errors' => [
					'uploaded' => 'Harus Ada File yang diupload',
					'ext_in' => 'File Extention Harus Berupa jpg,jpeg,gif,png',
					'max_size' => 'Ukuran File Maksimal 2 MB'
				]

			]
		])) {
			session()->setFlashdata('error', $this->validator->listErrors());
			return redirect()->back()->withInput();
		}

		$berkas = new PengumumanModel();
		$dataBerkas = $this->request->getFile('berkas');
		$fileName = $dataBerkas->getRandomName();
		$berkas->insert([
			'berkas' => $fileName,
			'keterangan' => $this->request->getPost('keterangan')
		]);
---
INSERT INTO `berkas` (`berkas`, `keterangan`, `created_at`, `updated_at`) VALUES ('1685505740_bbe89b907dc648c4c02e.pdf', 'aasaka', '2023-05-31 11:02:20', '2023-05-31 11:02:20')