app/Controllers/Keuangan/Transaksi.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '2'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
WHERE `transaksi`.`id_jenis_transaksi` IN (1,2)
ORDER BY `updated_at` DESC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
WHERE `transaksi`.`id_jenis_transaksi` IN (1,2)
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `jenis_pembayaran` ON `jenis_pembayaran`.`id_jenis_pembayaran` = `transaksi`.`id_jenis_pembayaran`
WHERE `transaksi`.`id_jenis_transaksi` IN (1,2)
---
    public function riwayat()
{
    $limit = 9; // Jumlah item per halaman
    $currentPage = $this->request->getVar('page_pagination') ? $this->request->getVar('page_pagination') : 1;

    $data = [
        'title' => 'Parking Management System',
        'user' => $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->where('npm', session('npm'))
            ->first(),
        'transaksi' => $this->transaksiModel
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->whereIn('transaksi.id_jenis_transaksi', [1, 2]) // Menggunakan whereIn untuk mencari id_jenis_transaksi 1 atau 2
            ->orderBy('updated_at', 'DESC')
            ->paginate($limit, 'pagination'),
        'pager' => $this->transaksiModel
            ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
            ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
            ->whereIn('transaksi.id_jenis_transaksi', [1, 2]) // Menggunakan whereIn untuk mencari id_jenis_transaksi 1 atau 2
            ->orderBy('created_at', 'DESC')
            ->pager,