app/Controllers/User/Dashboard.php

SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `npm` = '4'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `transaksi`.`npm` = '4'
 LIMIT 1
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`npm` = `transaksi`.`npm`
JOIN `jenis_transaksi` ON `jenis_transaksi`.`id_jenis_transaksi` = `transaksi`.`id_jenis_transaksi`
JOIN `status_transaksi` ON `status_transaksi`.`id_status_transaksi` = `transaksi`.`id_status_transaksi`
WHERE `transaksi`.`npm` = '4'
---
    public function index()
    {
        $data =
            [
                'title' => 'Parking Management System',
                'user' => $this->userModel
                    ->join('role', 'role.id_role = user.id_role')
                    ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                    ->where('npm', session('npm'))
                    ->first(),
                'transaksi' => $this->transaksiModel
                    ->join('user', 'user.npm = transaksi.npm')
                    ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                    ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                    ->join('role', 'role.id_role = user.id_role')
                    ->join('kartu', 'kartu.id_kartu = user.id_kartu')
                    ->where('transaksi.npm', session('npm'))
                    ->first(),
                'riwayat' => $this->transaksiModel
                    ->join('user', 'user.npm = transaksi.npm')
                    ->join('jenis_transaksi', 'jenis_transaksi.id_jenis_transaksi = transaksi.id_jenis_transaksi')
                    ->join('status_transaksi', 'status_transaksi.id_status_transaksi = transaksi.id_status_transaksi')
                    ->where('transaksi.npm', session('npm'))
                    ->findAll(),