app/Controllers/Operator/CheckOut.php

    public function index()
    {
        $nomimal_transaksi = $this->request->getVar('nominal_transaksi');
        $user_parking = $this->userModel
            ->join('kartu', 'kartu.id_kartu = user.id_kartu')
            ->where('kartu.nomor_kartu', $this->request->getVar('nomor_kartu'))
            ->first();
---
SELECT *
FROM `user`
JOIN `kartu` ON `kartu`.`id_kartu` = `user`.`id_kartu`
WHERE `kartu`.`nomor_kartu` = '456'
 LIMIT 1