app/Controllers/Operator/Dashboard.php

    public function riwayat()
{
    $limit = 9; // Jumlah item per halaman
    $offset = $this->request->getVar('page') ? ($this->request->getVar('page') - 1) * $limit : 0;
    $totalRows = $this->transaksiModel->where('id_jenis_transaksi', 3)->countAllResults();

    $data = [
        'title' => 'Parking Management System',
        'user' => $this->userModel
            ->join('role', 'role.id_role = user.id_role')
            ->where('npm', session('npm'))
            ->first(),
        'parkir_motor' => $this->hargaModel->where('nama_harga', 'parkir_motor')->first(),
        'parkir_mobil' => $this->hargaModel->where('nama_harga', 'parkir_mobil')->first(),
        'riwayat' => $this->transaksiModel->where('id_jenis_transaksi', 3)
        ->findAll($limit, $offset),
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `id_jenis_transaksi` = 3
SELECT *
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `npm` = '3'
 LIMIT 1
SELECT *
FROM `transaksi`
WHERE `id_jenis_transaksi` = 3
ORDER BY `updated_at` DESC
 LIMIT 9